app/controllers/posts_controller.rb

SELECT  `blogs`.* FROM `blogs` WHERE `blogs`.`id` = 1 LIMIT 1
---
  def set_blog
    @blog = Blog.find(params[:blog_id])